In [12]:
import numpy as np
import pandas as pd
HR=pd.read_excel('Human resource (1).xlsx')
HR.head()

          Employee Name         Department  Salary  Age  Gender Date of Join
0    Wilson  K Adinolfi  Production          62506   49   Male    07-05-2011
1  Karthikeyan Ait Sidi              IT/IS  104437   55   Male    30-03-2015
2      Sarah Akinkuolie  Production          64955   49  Female   07-05-2011
3          Trina Alagbe  Production          64991   49  Female   01-07-2008
4        Carol Anderson  Production          50825   31  Female   07-11-2011

In [13]:
Hr.tail()

        Employee Name         Department  Salary  Age  Gender Date of Join
306     Jason Woodson  Production          65893   39   Male    07-07-2014
307  Catherine Ybarra  Production          48513   35  Female   09-02-2008
308   Jennifer Zamora              IT/IS  220450   42  Female   04-10-2010
309        Julia Zhou              IT/IS   89292   42  Female   30-03-2015
310      Colleen Zima  Production          45046   58  Female   29-09-2014

### Find the Total Salary

In [14]:
x=HR['Salary'].sum()
x

21465433

### Find the average salary given in the company

In [15]:
x=HR['Salary'].mean()
x

69020.6848874598

### Find the Maximum salary

In [16]:
x=HR['Salary'].max()
x

250000

### Find the minimum Salary

In [17]:
x=HR['Salary'].min()
x

45046

### Find the range of salary

In [18]:
# max-min
250000-45046

204954

### Find the descriptive Statistics for the variable Salary and identify the Varience

### Find the average age of employees

In [19]:
x=HR['employees'].mean()
x

KeyError: 'employees'

### Find the minimum age of employees

### Find the maximum age of employees

### Find the descriptive Statistics for the variable Age and identify the Quartiles

### Find the count of Gender

### Find the Frequency of gender in a Bar Chart. modify the chart

### obtain the percentage value of number of male and female employees

### obtain the percentage value of number of male and female employees in a pie chart. modify the chart